jetstream/web/publish/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-01-17 Tue 13:44 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Welcome to Unidata on XSEDE Jetstream Cloud</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Julien Chastang" />

    <link href='https://fonts.googleapis.com/css?family=Gentium+Book+Basic:400,400i,700' rel='stylesheet' />
</head>
<body>
<div id="content">
<h1 class="title">Welcome to Unidata on XSEDE Jetstream Cloud</h1>
<p>
Welcome to the Unidata Jetstream installation. As part of <a href="https://www.unidata.ucar.edu/publications/Unidata_2018.pdf">Unidata's 2018 Five-year plan (PDF)</a>, Unidata is exploring the use of cloud computing. Here you will find
</p>

<ul class="org-ul">
<li>An <a href="http://jetstream.unidata.ucar.edu/thredds/catalog.html">operational THREDDS Data server</a> supplying a good portion of the data available on the IDD (one day archive).</li>
<li>The <a href="http://jetstream.unidata.ucar.edu/repository">RAMADDA geoscience content management</a> system. Therein you will find <a href="http://jetstream.unidata.ucar.edu/repository/entry/show?entryid=0d0cbe65-2f39-4754-801f-a3f996693ed9">IDV bundles</a> that retrieve data from Jetstream data servers (e.g., the TDS, RAMADDA, and ADDE running on Jetstream).</li>
<li>An ADDE server available at <code>jetstream.unidata.ucar.edu</code> over the usual port <code>112</code>.</li>
</ul>

<p>
Behind the scenes, there is an LDM relay supplying data to various Unidata VMs on the Jetstream Cloud.
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Under the Hood</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
The work presented here makes heavy use of the Docker and the containerization efforts
that have been going on this past year at Unidata. <a href="jetstream.html">See here to learn how this VM was configured</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
Last updated on Tue Jan 17 13:44:36 2017
</div>
</body>
</html>
